package interface1;

public class Main {


    public static void main(String[] args) {
        int i = 0;
        String новийКанал = "ХХХ";
//        ЗмінювачКаналів[] змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
//
//        for (int i = 0; i < змінювачКаналівs.length; i++) {
//            ЗмінювачКаналів змінювачКаналів = змінювачКаналівs[i];
//            змінювачКаналів.переключитиКаналНа(новийКанал);
//        }
        System.out.println(i++);
        ЗмінювачКаналів змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        змінювачКаналівs.переключитиКаналНа(новийКанал);

        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);
        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        змінювачКаналівs = ВзятиДанніЗБазиДанних.дайЗмінювачі();
        System.out.println(i++);

        змінювачКаналівs.переключитиКаналНа(новийКанал);
        System.out.println(i++);
    }

 /// S O LID

}
